{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-23T18:25:37.7854883Z","creationSource":null,"description":"Enforces BitLocker encryption using XTS-AES 256 for all system and data drives, with centralized recovery key backup. Ensures robust data protection and compliance with enterprise encryption standards.","lastModifiedDateTime":"2025-07-29T19:29:47.6946141Z","name":"BHC - BitLocker Encryption","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":4,"technologies":"mdm","id":"895ce98c-769f-4398-b404-4b4a556069f4","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_requiredeviceencryption","settingInstanceTemplateReference":{"settingInstanceTemplateId":"20ec1f6e-0d7a-4b6f-9a4f-9ed33e69ce51"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_requiredeviceencryption_1","settingValueTemplateReference":{"settingValueTemplateId":"86da5fa5-67cf-48d1-8215-8787a9900ae6","useTemplateDefault":false},"children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d1625438-8db8-424f-b605-cf001b7a2f97"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1","settingValueTemplateReference":{"settingValueTemplateId":"7cd99564-6bd0-42c8-be6a-5d92c6c1faaf","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_7","settingValueTemplateReference":{"settingValueTemplateId":"7cd99564-6bd0-42c8-be6a-5d92c6c1faaf","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_7","settingValueTemplateReference":{"settingValueTemplateId":"7cd99564-6bd0-42c8-be6a-5d92c6c1faaf","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_7","settingValueTemplateReference":{"settingValueTemplateId":"7cd99564-6bd0-42c8-be6a-5d92c6c1faaf","useTemplateDefault":false},"children":[]}}]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesencryptiontype","settingInstanceTemplateReference":{"settingInstanceTemplateId":"d3e31794-1ce6-4572-ab0c-0c0f9200a509"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_1","settingValueTemplateReference":{"settingValueTemplateId":"54f346c7-008f-421c-bcb5-40f822bb97fe","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_1","settingValueTemplateReference":{"settingValueTemplateId":"54f346c7-008f-421c-bcb5-40f822bb97fe","useTemplateDefault":false},"children":[]}}]}}},{"id":"3","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions","settingInstanceTemplateReference":{"settingInstanceTemplateId":"5a350519-4bc6-4443-9c4b-6859a054ff83"},"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_0","children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_2","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_0","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_0","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}},{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name","settingInstanceTemplateReference":null,"choiceSettingValue":{"value":"device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_0","settingValueTemplateReference":{"settingValueTemplateId":"2a756c45-f135-442f-9c01-829a9c9b5407","useTemplateDefault":false},"children":[]}}]}}}]}