{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-23T18:20:01.8569942Z","creationSource":null,"description":"This policy configures the alignment of the Start menu and taskbar icons on Windows 11 devices.\n\nWhen set to Left:\n\nThe Start button and app icons are aligned to the bottom-left corner of the taskbar—similar to the traditional layout from Windows 10 and earlier.\n\nThis setting offers a familiar user experience for organizations migrating from legacy Windows environments.\n\nThe configuration is enforced at the device level, preventing users from changing the Start menu alignment through personal settings.","lastModifiedDateTime":"2025-07-24T14:52:27.3240094Z","name":"BHC - Windows - Start Menu Left Align","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"45607d8c-a7ef-41df-baf4-9bba6669695d","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_start_startlayout","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"Left"}}}]}