{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-23T18:22:54.3727225Z","creationSource":null,"description":"\nThis policy determines which configuration source takes precedence when the same setting is deployed via both Group Policy and MDM (e.g., Intune). When this setting is enabled:\n\nIf a conflict arises between a policy from MDM and a local or domain-based Group Policy, the MDM policy overrides the GP setting.\n\nThe Group Policy object is blocked from applying, and its corresponding registry entries are ignored.\n\nThe final policy applied to the device reflects the MDM-defined configuration only.","lastModifiedDateTime":"2025-07-24T14:51:33.9730061Z","name":"BHC - Windows - Settings Catalog Control Policy Conflict","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"1dbb1ec1-105c-422c-81e9-e50c77ec2712","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_controlpolicyconflict_mdmwinsovergp","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_controlpolicyconflict_mdmwinsovergp_1","children":[]}}}]}