{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-23T18:22:27.6504318Z","creationSource":null,"description":"This policy enforces a specific time zone setting on Windows devices by locking it to Mountain Standard Time (MST), which corresponds to:\n\nUTC Offset: -07:00\n\nObserved Time Zones:\n\nMST (no daylight saving) – e.g., Phoenix, AZ\n\nMDT (Mountain Daylight Time, if daylight saving is applicable) – e.g., Denver, CO\n\nWhen enabled:\n\nThe user cannot change the system time zone via Settings or Control Panel.\n\nThe configured time zone applies to all user profiles and system services.","lastModifiedDateTime":"2025-07-24T14:51:59.1619319Z","name":"BHC - Windows - Settings Catalog TimeZone","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"7b2ec032-f3d3-434c-bfe7-bff50883b4d8","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_timelanguagesettings_configuretimezone","settingInstanceTemplateReference":null,"simpleSettingValue":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationStringSettingValue","settingValueTemplateReference":null,"value":"Mountain Standard Time"}}}]}