{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2025-07-23T18:23:18.4325182Z","creationSource":null,"description":"This setting governs whether Direct Memory Access (DMA) capable devices are allowed to access system memory while the computer is locked or in standby/sleep mode.\n\nDirect Memory Access (DMA) is a capability that allows certain hardware (e.g., external PCIe devices, Thunderbolt peripherals) to read/write directly to system memory without going through the CPU.\n\nThis policy directly influences system I/O performance and security posture, especially when using high-speed ports (Thunderbolt, USB4, PCIe expansion cards).","lastModifiedDateTime":"2025-07-24T14:51:08.5973876Z","name":"BHC - Windows - Security Baseline Data Protection","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":1,"technologies":"mdm","id":"220c46f6-301f-4332-98aa-3b8e4e5aae7a","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"device_vendor_msft_policy_config_dataprotection_allowdirectmemoryaccess","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"device_vendor_msft_policy_config_dataprotection_allowdirectmemoryaccess_0","children":[]}}}]}